index.org
#+SETUPFILE: ./org-html-themes/org/theme-readtheorg.setup
#+Title: Seminar Data Science for Economics
#+Author: Jan Boone
#+LANGUAGE: en
#+LaTeX_CLASS: article-12
#+LATEX_HEADER: \renewcommand{\floatpagefraction}{.8} %% avoids figures getting their own page
#+latex_header: \input{author.tex}
#+latex_engraved_theme: t
#+EXPORT_SELECT_TAGS: export
#+EXPORT_EXCLUDE_TAGS: noexport
#+OPTIONS: toc:nil num:2 timestamp:nil ':t \n:nil @:t ::t |:t ^:{} _:{} *:t TeX:t LaTeX:t
#+HTML_HEAD: <link rel="stylesheet" href="./css/Latex.css">
#+HTML_HEAD: <link rel="stylesheet" href="https://latex.now.sh/prism/prism.css">
#+HTML_HEAD: <script src="https://cdn.jsdelivr.net/npm/prismjs/prism.min.js"></script>
#+EXPORT_EXCLUDE_TAGS: noexport


This website contains the material for the MSc course Seminar Data Science for Economics

**This website is under construction for 2025/2026**

This year the course is taught by:
+ Jan Boone
+ Mia Aktaş

* Course description
  :PROPERTIES:
  :CUSTOM_ID:       course_description
  :END:

In the course Data Science for Economics you will learn how to deal with big data and using simulations to answer policy questions using recent advances in machine learning.

Whether you are a public policy-maker or a data analyst at a private firm, you might be tasked with providing answers to questions like "What is the optimal pricing scheme for our products?" or "Who should receive state benefits?". In such cases you want to use large data to provide convincing policy prescriptions. However, there are different challenges to it such as obtaining the data, cleaning it, collaborating with your co-workers, and most importantly deciding which variables to use in your analysis.

This course will help you overcome those challenges. The "traditional" econometrics you have learned in previous classes provides you with solid knowledge in answering causal questions. Machine learning toolkit, which you will also learn to apply in this class, is primarily targeted to provide the best prediction rather than to answer causal questions. However, when combined together they will help you to work with highly-dimensional datasets, where there can be more variables than observations, and you do not know at the start which variables and interaction terms to include.

In this course, we give an introduction to data-project management, tensors (data with more than 2 dimensions), data simulation, neural networks, cross validation. The goal is to get you up to speed with developments in datascience applicable for economic analysis.

We use data simulation to get the main intuitions across starting from the difference between correlation and causality. We cover the estimation of neural networks using training, test and validation sets and Bayesian estimation techniques.

In terms of software we will be using [[https://www.python.org/][python]], [[https://www.pymc.io/welcome.html][pymc]] and google's [[https://www.tensorflow.org/][tensorflow]].

For this course we are very happy that we partner with [[https://www.datacamp.com/][Datacamp]]: [[https://www.tilburguniversity.edu/students/skills/programming][register for Datacamp]]

*Required Prerequisites*

Students make sure they follow Econometrics 1 and the mandatory course Methods: Python programming for economists.

------------------
#+TOC: headlines 2

-----------------

* Screencasts
  :PROPERTIES:
  :CUSTOM_ID:       screencasts_datascience
  :END:

For this course a series of screencasts is available. Screencasts are available for [[file:./pagescreencasts.org][part 1]] and [[./pagescreencasts2.org][part 2]].


