index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Seminar Data Science for Economics</title>
<meta name="author" content="Jan Boone" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
<link rel="stylesheet" href="./css/Latex.css">
<link rel="stylesheet" href="https://latex.now.sh/prism/prism.css">
</head>
<body>
<div id="content" class="content">
<h1 class="title">Seminar Data Science for Economics</h1>
<p>
This website contains the material for the MSc course Seminar Data Science for Economics
</p>

<p>
<b><b>This website is under construction for 2025/2026</b></b>
</p>

<p>
This year the course is taught by:
</p>
<ul class="org-ul">
<li>Jan Boone</li>
<li>Mia Aktaş</li>
</ul>
<div id="outline-container-course_description" class="outline-2">
<h2 id="course_description"><span class="section-number-2">1.</span> Course description</h2>
<div class="outline-text-2" id="text-course_description">
<p>
In the course Data Science for Economics you will learn how to deal with big data and using simulations to answer policy questions using recent advances in machine learning.
</p>

<p>
Whether you are a public policy-maker or a data analyst at a private firm, you might be tasked with providing answers to questions like &ldquo;What is the optimal pricing scheme for our products?&rdquo; or &ldquo;Who should receive state benefits?&rdquo;. In such cases you want to use large data to provide convincing policy prescriptions. However, there are different challenges to it such as obtaining the data, cleaning it, collaborating with your co-workers, and most importantly deciding which variables to use in your analysis.
</p>

<p>
This course will help you overcome those challenges. The &ldquo;traditional&rdquo; econometrics you have learned in previous classes provides you with solid knowledge in answering causal questions. Machine learning toolkit, which you will also learn to apply in this class, is primarily targeted to provide the best prediction rather than to answer causal questions. However, when combined together they will help you to work with highly-dimensional datasets, where there can be more variables than observations, and you do not know at the start which variables and interaction terms to include.
</p>

<p>
In this course, we give an introduction to data-project management, tensors (data with more than 2 dimensions), data simulation, neural networks, cross validation. The goal is to get you up to speed with developments in datascience applicable for economic analysis.
</p>

<p>
We use data simulation to get the main intuitions across starting from the difference between correlation and causality. We cover the estimation of neural networks using training, test and validation sets and Bayesian estimation techniques.
</p>

<p>
In terms of software we will be using <a href="https://www.python.org/">python</a>, <a href="https://www.pymc.io/welcome.html">pymc</a> and google&rsquo;s <a href="https://www.tensorflow.org/">tensorflow</a>.
</p>

<p>
For this course we are very happy that we partner with <a href="https://www.datacamp.com/">Datacamp</a>: <a href="https://www.tilburguniversity.edu/students/skills/programming">register for Datacamp</a>
</p>

<p>
<b>Required Prerequisites</b>
</p>

<p>
Students make sure they follow Econometrics 1 and the mandatory course Methods: Python programming for economists.
</p>

<hr />
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#course_description">1. Course description</a></li>
<li><a href="#screencasts_datascience">2. Screencasts</a></li>
<li><a href="#organisation_datascience">3. Organisation of the course</a>
<ul>
<li><a href="#orgb8efa32">3.1. First Lecture</a></li>
<li><a href="#org0c5d65d">3.2. Datacamp</a></li>
<li><a href="#org60f8a90">3.3. From Datacamp, do the following courses for the first part of the course</a></li>
<li><a href="#org71f9849">3.4. For the second part of the course, you can do the following datacamp courses:</a></li>
<li><a href="#org97cbf2b">3.5. Other resources</a></li>
<li><a href="#Deadlines">3.6. Deadlines</a></li>
<li><a href="#orga7b2452">3.7. Questions</a></li>
<li><a href="#orgd9f32db">3.8. Assessment material</a></li>
</ul>
</li>
<li><a href="#Finalassignment">4. Final Assignment</a>
<ul>
<li><a href="#org3df32ad">4.1. what we are looking for</a></li>
<li><a href="#orga287d34">4.2. resit of final assignment</a></li>
</ul>
</li>
</ul>
</div>
</div>

<hr />
</div>
</div>
<div id="outline-container-screencasts_datascience" class="outline-2">
<h2 id="screencasts_datascience"><span class="section-number-2">2.</span> Screencasts</h2>
<div class="outline-text-2" id="text-screencasts_datascience">
<p>
For this course a series of screencasts is available. Screencasts are available for <a href="./pagescreencasts.html">part 1</a> and <a href="./pagescreencasts2.html">part 2</a>.
</p>
</div>
</div>
