index.org
* Organisation of the course
   :PROPERTIES:
   :CUSTOM_ID:       organisation_datascience
   :END:

| day |       date |        time | room     | topic                                         | datacamp                                    | assignment |
|-----+------------+-------------+----------+-----------------------------------------------+---------------------------------------------+------------|
| Tue | 2026-01-27 | 14:45-16:30 | TZ 11    | Introduction to the course                    | statistical simulation 1-4                  |            |
| Tue | 2026-02-03 | 14:45-16:30 | TZ 11    | part 1: distributions, bootstrapping          | keras 1-4                                   |            |
| Tue | 2026-02-10 | 14:45-16:30 | Cube 214 | OLS, causality                                | tensorflow 1-4                              |            |
| Tue | 2026-02-24 | 14:45-16:30 | TZ 11    | tensors, first neural network                 |                                             |            |
| Thu | 2026-02-26 | 10:45-12:30 | DZ 7     | over/under fitting, neural network            |                                             |            |
| Tue | 2026-03-03 | 08:45-10:30 | TZ 11    | treatment effects                             |                                             |            |
| Thu | 2026-03-05 | 10:45-12:30 | DZ 7     | part 2: dealing with data                     |                                             |            |
| Tue | 2026-03-10 | 10:45-12:30 | Cube 221 | Bayesian statistics                           |                                             |            |
| Thu | 2026-03-12 | 10:45-12:30 | TZ 11    | estimating a Bayesian model, missing data     | [[https://www.youtube.com/watch?v=TMmSESkhRtI]] |            |
| Tue | 2026-03-17 | 14:45-16:30 | TZ 11    | Bayesian time series, Bayesian neural network |                                             |            |
| Thu | 2026-03-19 | 10:45-12:30 | DZ 7     | confidence interval and Q&A                   |                                             |            |
| Fri | 2026-04-24 |       23:59 |          |                                               |                                             | deadline   |
| Fri | 2026-06-19 |             |          |                                               |                                             | resit      |

										      

+ we will see how fast we go, the column "topics" is an indication of what will be discussed in each week
+ for the first part, you will go through [[https://github.com/janboone/msc_datascience/blob/master/Statistical_Hacking.ipynb][this notebook]]
+ for the second part, through [[https://github.com/janboone/msc_datascience/blob/master/hacking_part_2.ipynb][this one]]
+ there is also a [[https://app.datacamp.com/learn/courses/introduction-to-version-control-with-git][Datacamp course on git]]: this is recommended but not mandatory

** First Lecture

[[file:Introduction_Lecture.org::#introduction][Introduction]]

*** Assignment 1
:PROPERTIES:
:CUSTOM_ID:       assignment1
:END:

Do the following steps:
+ if you did Methods: Python programming for economists, you already have a [[https://github.com/][github]] account, otherwise create a github account
+ go to
  + [[https://jupyterlab.uvt.nl/][jupyter lab]]
    + IT suggests that you use the Firefox browser to access jupyter lab
    + sometimes it helps to access jupyter lab with an incognito/private window
  + or --if all else fails-- you can use [[https://colab.research.google.com/][google's colab]]
+ create a new python notebook and type the following code in the first cell:
#+BEGIN_SRC ipython
%%bash

git clone https://github.com/janboone/msc_datascience.git
#+END_SRC
+ then press the Shift key and Enter key as the same time
+ this creates a folder on the server ~msc_datascience~ that contains the material for the python part of the course.
+ Note: you can only run this command once. If you run it again, you get an error since the folder already exists.

*** Final assignment

+ instructions for the final assignment can be found below.


** Datacamp

