index.html
<div id="outline-container-organisation_datascience" class="outline-2">
<h2 id="organisation_datascience"><span class="section-number-2">3.</span> Organisation of the course</h2>
<div class="outline-text-2" id="text-organisation_datascience">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">day</th>
<th scope="col" class="org-right">date</th>
<th scope="col" class="org-right">time</th>
<th scope="col" class="org-left">room</th>
<th scope="col" class="org-left">topic</th>
<th scope="col" class="org-left">datacamp</th>
<th scope="col" class="org-left">assignment</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Tue</td>
<td class="org-right">2026-01-27</td>
<td class="org-right">14:45-16:30</td>
<td class="org-left">TZ 11</td>
<td class="org-left">Introduction to the course</td>
<td class="org-left">statistical simulation 1-4</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Tue</td>
<td class="org-right">2026-02-03</td>
<td class="org-right">14:45-16:30</td>
<td class="org-left">TZ 11</td>
<td class="org-left">part 1: distributions, bootstrapping</td>
<td class="org-left">keras 1-4</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Tue</td>
<td class="org-right">2026-02-10</td>
<td class="org-right">14:45-16:30</td>
<td class="org-left">Cube 214</td>
<td class="org-left">OLS, causality</td>
<td class="org-left">tensorflow 1-4</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Tue</td>
<td class="org-right">2026-02-24</td>
<td class="org-right">14:45-16:30</td>
<td class="org-left">TZ 11</td>
<td class="org-left">tensors, first neural network</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Thu</td>
<td class="org-right">2026-02-26</td>
<td class="org-right">10:45-12:30</td>
<td class="org-left">DZ 7</td>
<td class="org-left">over/under fitting, neural network</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Tue</td>
<td class="org-right">2026-03-03</td>
<td class="org-right">08:45-10:30</td>
<td class="org-left">TZ 11</td>
<td class="org-left">treatment effects</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Thu</td>
<td class="org-right">2026-03-05</td>
<td class="org-right">10:45-12:30</td>
<td class="org-left">DZ 7</td>
<td class="org-left">part 2: dealing with data</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Tue</td>
<td class="org-right">2026-03-10</td>
<td class="org-right">10:45-12:30</td>
<td class="org-left">Cube 221</td>
<td class="org-left">Bayesian statistics</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Thu</td>
<td class="org-right">2026-03-12</td>
<td class="org-right">10:45-12:30</td>
<td class="org-left">TZ 11</td>
<td class="org-left">estimating a Bayesian model, missing data</td>
<td class="org-left"><a href="https://www.youtube.com/watch?v=TMmSESkhRtI">https://www.youtube.com/watch?v=TMmSESkhRtI</a></td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Tue</td>
<td class="org-right">2026-03-17</td>
<td class="org-right">14:45-16:30</td>
<td class="org-left">TZ 11</td>
<td class="org-left">Bayesian time series, Bayesian neural network</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Thu</td>
<td class="org-right">2026-03-19</td>
<td class="org-right">10:45-12:30</td>
<td class="org-left">DZ 7</td>
<td class="org-left">confidence interval and Q&amp;A</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">Fri</td>
<td class="org-right">2026-04-24</td>
<td class="org-right">23:59</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">deadline</td>
</tr>

<tr>
<td class="org-left">Fri</td>
<td class="org-right">2026-06-19</td>
<td class="org-right">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">resit</td>
</tr>
</tbody>
</table>



<ul class="org-ul">
<li>we will see how fast we go, the column &ldquo;topics&rdquo; is an indication of what will be discussed in each week</li>
<li>for the first part, you will go through <a href="https://github.com/janboone/msc_datascience/blob/master/Statistical_Hacking.ipynb">this notebook</a></li>
<li>for the second part, through <a href="https://github.com/janboone/msc_datascience/blob/master/hacking_part_2.ipynb">this one</a></li>
<li>there is also a <a href="https://app.datacamp.com/learn/courses/introduction-to-version-control-with-git">Datacamp course on git</a>: this is recommended but not mandatory</li>
</ul>
</div>
<div id="outline-container-orgb8efa32" class="outline-3">
<h3 id="orgb8efa32"><span class="section-number-3">3.1.</span> First Lecture</h3>
<div class="outline-text-3" id="text-3-1">
<p>
<a href="Introduction_Lecture.html#introduction">Introduction</a>
</p>
</div>
<div id="outline-container-assignment1" class="outline-4">
<h4 id="assignment1">Assignment 1</h4>
<div class="outline-text-4" id="text-assignment1">
<p>
Do the following steps:
</p>
<ul class="org-ul">
<li>if you did Methods: Python programming for economists, you already have a <a href="https://github.com/">github</a> account, otherwise create a github account</li>
<li>go to
<ul class="org-ul">
<li><a href="https://jupyterlab.uvt.nl/">jupyter lab</a>
<ul class="org-ul">
<li>IT suggests that you use the Firefox browser to access jupyter lab</li>
<li>sometimes it helps to access jupyter lab with an incognito/private window</li>
</ul></li>
<li>or &#x2013;if all else fails&#x2013; you can use <a href="https://colab.research.google.com/">google&rsquo;s colab</a></li>
</ul></li>
<li>create a new python notebook and type the following code in the first cell:</li>
</ul>
<div class="org-src-container">
<pre class="src src-ipython">%%bash

git clone https://github.com/janboone/msc_datascience.git
</pre>
</div>
<ul class="org-ul">
<li>then press the Shift key and Enter key as the same time</li>
<li>this creates a folder on the server <code>msc_datascience</code> that contains the material for the python part of the course.</li>
<li>Note: you can only run this command once. If you run it again, you get an error since the folder already exists.</li>
</ul>
</div>
</div>
<div id="outline-container-org65471d1" class="outline-4">
<h4 id="org65471d1">Final assignment</h4>
<div class="outline-text-4" id="text-org65471d1">
<ul class="org-ul">
<li>instructions for the final assignment can be found below.</li>
</ul>
</div>
</div>
</div>
