index.html
<div id="outline-container-org0c5d65d" class="outline-3">
<h3 id="org0c5d65d"><span class="section-number-3">3.2.</span> Datacamp</h3>
</div>

<div id="outline-container-org60f8a90" class="outline-3">
<h3 id="org60f8a90"><span class="section-number-3">3.3.</span> From Datacamp, do the following courses for the first part of the course</h3>
<div class="outline-text-3" id="text-3-3">
<ul class="org-ul">
<li><a href="https://www.datacamp.com/courses/statistical-simulation-in-python">statistical simulation</a></li>
<li><a href="https://www.datacamp.com/courses/deep-learning-with-keras-in-python">keras</a></li>
<li><a href="https://www.datacamp.com/courses/introduction-to-tensorflow-in-python">tensorflow</a></li>
</ul>

<p>
A couple of notes on these datacamp courses:
</p>

<p>
The <a href="https://www.datacamp.com/courses/statistical-simulation-in-python">statistical simulation</a> course starts with very simple statistical concepts. But rapidly things become more challenging. The focus of our seminar will not be on statistical simulation per se, but we will use it to understand the properties of estimators. Hence, it is important to understand the &ldquo;flow&rdquo; of having a statistical process and then repeating it 10,000 times to understand its properties. You also learn how to use numpy&rsquo;s statistical functions from <code>numpy.random</code>.
</p>

<p>
The point for us of this Datacamp course is to become comfortable with modeling data generating processes. Not the specific applications considered in this course.
</p>

<p>
You may not have seen the <code>get</code> method of a dictionary. Here you see it in action in a simple example (borrowed from <a href="https://stackoverflow.com/questions/2068349/understanding-get-method-in-python">stackoverflow</a>):
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #e95678;">sentence</span>=<span style="color: #fab795;">"The quick brown fox jumped over the lazy dog."</span>
<span style="color: #e95678;">characters</span>={}

<span style="color: #b877db;">for</span> character <span style="color: #b877db;">in</span> sentence:
    <span style="color: #e95678;">characters</span>[character] = characters.get(character, 0) + 1

<span style="color: #b877db;">print</span>(characters)
</pre>
</div>

<pre class="example">
{'T': 1, 'h': 2, 'e': 4, ' ': 8, 'q': 1, 'u': 2, 'i': 1, 'c': 1, 'k': 1, 'b': 1, 'r': 2, 'o': 4, 'w': 1, 'n': 1, 'f': 1, 'x': 1, 'j': 1, 'm': 1, 'p': 1, 'd': 2, 'v': 1, 't': 1, 'l': 1, 'a': 1, 'z': 1, 'y': 1, 'g': 1, '.': 1}
</pre>


<p>
<code>characters</code> is a dictionary with <code>key</code> a character (including &ldquo;space&rdquo;) from the <code>sentence</code> and the <code>value</code> equals the number of times the character has occurred up till then. If a character &ldquo;happens&rdquo; for the first time, <code>get</code> cannot find it in the dictionary <code>characters</code> and returns the default value (here specified as 0). If character has happened, say, 3 times before, <code>get</code> returns the value 3 and we add 1, so the new value equals 4.
</p>

<p>
If you run into other functions that you are not familiar with, you can use &ldquo;?&rdquo;, like in:
</p>

<div class="org-src-container">
<pre class="src src-python">np.random.binomial?
</pre>
</div>

<p>
Also, you can google, use chatgpt or bard.
</p>

<p>
Things to take away from this course:
</p>
<ul class="org-ul">
<li>how to use random variables in python</li>
<li>how to create samples out of a population (e.g. by using <code>np.random.choice</code>)</li>
<li>how to model statistical processes (data generating processes)</li>
<li>how to use resampling methods like bootstrapping</li>
<li>how to use permutation testing</li>
<li>how to use simulation for power analysis</li>
</ul>

<p>
This <a href="https://www.datacamp.com/courses/deep-learning-with-keras-in-python">keras</a> course is &ldquo;hands on&rdquo; and has a lot of applications. If you prefer a course with some more background on the math of neural networks, you can do <a href="https://www.datacamp.com/courses/deep-learning-in-python">this one</a> instead.
</p>

<p>
Note that for this <a href="https://www.datacamp.com/courses/deep-learning-with-keras-in-python">keras</a> course Chapter 4 is fun but optional.
</p>

<p>
The <a href="https://www.datacamp.com/courses/introduction-to-tensorflow-in-python">tensorflow</a> course gives some more background on the syntax used in tensorflow that we also use in class. All the keras commands you learn in the keras course are easily applied under tensorflow.
</p>
</div>
</div>
<div id="outline-container-org71f9849" class="outline-3">
<h3 id="org71f9849"><span class="section-number-3">3.4.</span> For the second part of the course, you can do the following datacamp courses:</h3>
<div class="outline-text-3" id="text-3-4">
<ul class="org-ul">
<li>Resources for pymc can be found <a href="https://www.pymc.io/welcome.html">here.</a>
<ul class="org-ul">
<li>a good video to start with is <a href="https://www.youtube.com/watch?v=TMmSESkhRtI">this one</a> where one of the developers of pymc, Christopher Fonnesbeck, goes over the notebooks in this repository: <a href="https://github.com/fonnesbeck/intro_stat_modeling_2017">https://github.com/fonnesbeck/intro_stat_modeling_2017</a></li>
</ul></li>
</ul>

<p>
if you want to clone this repository in jupyter lab, run the following code on the server:
</p>

<div class="org-src-container">
<pre class="src src-ipython">%%bash

git clone https://github.com/fonnesbeck/intro_stat_modeling_2017.git
</pre>
</div>
</div>
<div id="outline-container-new_pymc" class="outline-4">
<h4 id="new_pymc">new version of <code>pymc</code></h4>
<div class="outline-text-4" id="text-new_pymc">
<p>
A change compared to previous years is that the university servers have upgraded <code>pymc3</code> to <code>pymc</code>. This affects some aspects of the <code>pymc</code> syntax used in the youtube link above and in our screencasts. Where relevant we will point this out on the screencast page and in our jupyter notebooks.
</p>

<p>
The new version of <code>pymc</code> is imported as <code>import pymc as pm</code>; no longer as <code>import pymc3 as pm</code>. This has a number of implications:
</p>
<ul class="org-ul">
<li>in the video and notebook we use <code>import pymc3 as pm</code> but this will give an error when you run it on the jupyterlab server; hence use <code>pymc</code> instead of <code>pymc3</code></li>
<li>the syntax for drawing samples from a distribution in <code>pymc</code> has changed:
<ul class="org-ul">
<li><code>pm.Normal.dist(0,1).random(size=10)</code> will given an error</li>
<li>now use the following two lines:</li>
</ul></li>
</ul>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #e95678;">x</span> = pm.Normal.dist(0,1)
pm.draw(x, draws=10)
</pre>
</div>

<p>
See <a href="https://www.pymc-labs.com/blog-posts/simulating-data-with-pymc/">this blog</a> for more information.
</p>
</div>
</div>
</div>
<div id="outline-container-org97cbf2b" class="outline-3">
<h3 id="org97cbf2b"><span class="section-number-3">3.5.</span> Other resources</h3>
<div class="outline-text-3" id="text-3-5">
<ul class="org-ul">
<li>Other useful skills for datascience you may want to look at:
<ul class="org-ul">
<li><a href="https://www.datacamp.com/courses/regular-expressions-in-python">regular expressions Python</a></li>
<li><a href="https://www.datacamp.com/courses/web-scraping-with-python">intro to scraping</a></li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-Deadlines" class="outline-3">
<h3 id="Deadlines"><span class="section-number-3">3.6.</span> Deadlines</h3>
<div class="outline-text-3" id="text-Deadlines">
<p>
The deadline for the <b>final assignment</b> is: Friday April 24th 2026 at 23:59.
</p>

<p>
The resit deadline for the assignment is: Friday June 19th, 2026. Let us know by email that you have submitted your assignment for the resit. Further, follow the instructions below on how to submit an assignment on github and fill in the google form etc.
</p>
</div>
</div>
