index.org
** Questions

 If you have questions/comments about this course, go to the [[https://github.com/janboone/msc_datascience/issues][issues page]]
 open a new issue (with the green "New issue" button) and type your
 question. Use a title that is informative (e.g. not "question", but
 "question about instrumental variables"). Go to the next box ("Leave a comment")
 and type your question. Then click on "Submit new issue". We will
 answer your question as quickly as possible.

 The advantages of the issue page include:

 + if you have a question, other students may have it as well; in this
   way we answer the questions in a way that everyone can see it. Also
   before asking the question, you may want to check whether it was
   asked/answered before on the issue page
 + we answer your question more quickly than when you email us
 + you increase your knowledge of github!

 Only when you need to include privately sensitive information ("my cat
 has passed away"), you can send an email.

 In order to post issues, you need to create a github account (which
 you need anyway to follow this course).

 Note that if your question is related to another issue, you can react
 to the earlier issue and leave a comment in that "conversation".

** Assessment material

We have a separate page with all relevant [[./Datascience_for_economics.org][assessment material]].

* Final Assignment
  :PROPERTIES:
  :CUSTOM_ID:       Finalassignment
  :END:

+ The final assignment you can do alone or with at max. one other student (i.e. max group size is 2).
+ for the deadline of the assignment, see [[Deadlines]] above
+ on Canvas we give you the link to the github repos. with the ~assignment_notebook.ipynb~
+ to submit your final assignment:
  + do not change the name of the ~assignment_notebook.ipynb~ notebook
  + fill in the google form published on Canvas
  + push the final notebook on the github classroom repository

** TODO Instructions for submitting final assignment to be put on Canvas :noexport:

- [ ] create assignment on github classroom with the datascience template/notebook (22-12-2025): https://classroom.github.com/a/-R8ZZqIz
  - https://classroom.github.com/classrooms/16413080-tisem-datascience-for-economics
- [ ] create google form for students to fill in once they finish assignment: https://forms.gle/xnhQEHnHWmY9purG6
- [ ] adjust the links under points 3 and 4 below in Canvas announcement (22-12-2025)

- attach instructions: [[file:Manual_students.pdf][manual for students]]
- create and post screencast where notebook is downloaded and uploaded on github
- show previous step during lecture


Dear students,

The link for the final datascience assignment (template) is:
- https://classroom.github.com/a/-R8ZZqIz

You can do the assignment on your own or with (at max.) one other student. When you use the link to the assignment, you will be asked for your team's name.

When you finish your assignment:

1. download your assignment (jupyter notebook and other material, like datasets, that you use) from jupyter lab (or google colabs; or check where it is on your computer when using anaconda) to your computer (e.g. in the folder Downloads)

2. push all relevant material onto your assignment's github repository

3. fill in this google form:  https://forms.gle/xnhQEHnHWmY9purG6

4. the format of your assignment link is: https://github.com/TiSEM/final-assignment-seminar-datascience-2025-2026-your-team (note that this is the "format" of the link; this link itself does not work...)

We need the information from the google form to link your assignment to your student number which is needed for the exam administration.

If you have questions about the assignment or the procedure described above, create an issue on the webpage at: https://github.com/janboone/msc_datascience/issues

Then you can see whether other students had the same question (which was already answered) or fellow-students can learn from your question. These issues can be read by anyone, so do not provide any privacy related information.

Good luck with the assignment,

Jan.

** what we are looking for

The idea of the assignment is that you report your findings in a transparent way that can easily be verified/reproduced by others. The intended audience is your fellow students. They should be able to understand the code you write together with the explanations that you give for this code.

The following ingredients will be important when we evaluate your assignment:

+ Create a "big dataset" from an economic organization providing data; think of:
  + [[https://stats.oecd.org][OECD]]
  + [[https://data.worldbank.org][World Bank]] (recall that we use a python API to access this data in Methods: Python programming; this you can use as well, of course)
  + [[https://www.imf.org/en/Data][IMF]]
  + [[https://www.federalreserve.gov/data.htm][Federal Reserve]]
  + [[https://data.europa.eu/euodp/en/data/][European Union]]
  + [[https://www.ecb.europa.eu/stats/html/index.en.html][European Central Bank]]
  + statistical office of your own country, e.g. [[https://opendata.cbs.nl/statline/#/CBS/en/][Statistics Netherlands]]
  + if you want to use another economic data source, ask us first
+ Data handling:    
  + download the data to your repos. (in a separate folder "data") and
  + in your notebook create a link to the website of the data source
  + give the code how you merged separate datasets into one big dataset that you use
  + explain what you did (including the code) and why you did the data cleaning steps to get the data from the downloads to the data that you use in the analysis
+ Start your analysis with a clear and transparent *question*.
+ Briefly *motivate* why this question is interesting.
+ Explain the *methods* that you use to answer the question.
  + are your methods based on correlations (only)?
  + do they allow you to make claims about causality?
+ Give the *answer* that you find (as a preview).
+ Mention the main *assumptions* that you need to get this answer.
+ Use graphs to introduce your data
+ If you use equations, use latex to make them easy to read.
+ Explain your code, the reader --think of your fellow students-- must be able to easily follow what you are doing.
+ How well does your model *fit* the data?
  + what methods do you use to evaluate this?
+ Present a clear conclusion/answer to your question.
+ Include some *discussion* of what you find and elements on which you need additional information.

Three remarks:
+ you can copy code from the web; but
  + make sure that you explain the code that you use so that another student of the course understands it and can use it;
  + give the reference of the code that you copy;
+ use *common sense*: it is not always necessary to have a full blown economic model, but we do expect you to think!
  + in the past we had students looking at the effect of age on income in sports; "theory" suggests that this relation is hump-shaped: 5 year olds and 80 year olds tend not to earn a lot of money as elite athletes; the students presented a scatter plot with a clear hump-shape; then they wrote "now we do a linear regression".
  + for each step that you program, ask yourself why this step makes sense and then explain this in your notebook.
+ show us what you have learned during this course; hence use a *number* of topics we discussed in your final assignment, for example:
  + simulate data to verify the estimation techniques that you use
  + download your data in the notebook using a python API
  + use pandas to merge different datasets, clean your data, create new variables
  + explain clearly what the causal relations are in your analysis
  + use methods like: ridge and lasso regressions, neural network, Bayesian analysis
    + explain why you use these methods to answer your research question (what are pros and cons of the methods)
    + explain the choices that you make within a method (think of the number of layers and epochs in a neural network)
    + use more than one method and compare the results:
      + discuss what is different and why
  + simply downloading an existing dataset and estimating a neural network on this will not be enough to get a passing grade

