index.html
<div id="outline-container-orga7b2452" class="outline-3">
<h3 id="orga7b2452"><span class="section-number-3">3.7.</span> Questions</h3>
<div class="outline-text-3" id="text-3-7">
<p>
If you have questions/comments about this course, go to the <a href="https://github.com/janboone/msc_datascience/issues">issues page</a>
open a new issue (with the green &ldquo;New issue&rdquo; button) and type your
question. Use a title that is informative (e.g. not &ldquo;question&rdquo;, but
&ldquo;question about instrumental variables&rdquo;). Go to the next box (&ldquo;Leave a comment&rdquo;)
and type your question. Then click on &ldquo;Submit new issue&rdquo;. We will
answer your question as quickly as possible.
</p>

<p>
The advantages of the issue page include:
</p>

<ul class="org-ul">
<li>if you have a question, other students may have it as well; in this
way we answer the questions in a way that everyone can see it. Also
before asking the question, you may want to check whether it was
asked/answered before on the issue page</li>
<li>we answer your question more quickly than when you email us</li>
<li>you increase your knowledge of github!</li>
</ul>

<p>
Only when you need to include privately sensitive information (&ldquo;my cat
has passed away&rdquo;), you can send an email.
</p>

<p>
In order to post issues, you need to create a github account (which
you need anyway to follow this course).
</p>

<p>
Note that if your question is related to another issue, you can react
to the earlier issue and leave a comment in that &ldquo;conversation&rdquo;.
</p>
</div>
</div>
<div id="outline-container-orgd9f32db" class="outline-3">
<h3 id="orgd9f32db"><span class="section-number-3">3.8.</span> Assessment material</h3>
<div class="outline-text-3" id="text-3-8">
<p>
We have a separate page with all relevant <a href="./Datascience_for_economics.html">assessment material</a>.
</p>
</div>
</div>
</div>
<div id="outline-container-Finalassignment" class="outline-2">
<h2 id="Finalassignment"><span class="section-number-2">4.</span> Final Assignment</h2>
<div class="outline-text-2" id="text-Finalassignment">
<ul class="org-ul">
<li>The final assignment you can do alone or with at max. one other student (i.e. max group size is 2).</li>
<li>for the deadline of the assignment, see <a href="#Deadlines">3.6</a> above</li>
<li>on Canvas we give you the link to the github repos. with the <code>assignment_notebook.ipynb</code></li>
<li>to submit your final assignment:
<ul class="org-ul">
<li>do not change the name of the <code>assignment_notebook.ipynb</code> notebook</li>
<li>fill in the google form published on Canvas</li>
<li>push the final notebook on the github classroom repository</li>
</ul></li>
</ul>
</div>
<div id="outline-container-org3df32ad" class="outline-3">
<h3 id="org3df32ad"><span class="section-number-3">4.1.</span> what we are looking for</h3>
<div class="outline-text-3" id="text-4-1">
<p>
The idea of the assignment is that you report your findings in a transparent way that can easily be verified/reproduced by others. The intended audience is your fellow students. They should be able to understand the code you write together with the explanations that you give for this code.
</p>

<p>
The following ingredients will be important when we evaluate your assignment:
</p>

<ul class="org-ul">
<li>Create a &ldquo;big dataset&rdquo; from an economic organization providing data; think of:
<ul class="org-ul">
<li><a href="https://stats.oecd.org">OECD</a></li>
<li><a href="https://data.worldbank.org">World Bank</a> (recall that we use a python API to access this data in Methods: Python programming; this you can use as well, of course)</li>
<li><a href="https://www.imf.org/en/Data">IMF</a></li>
<li><a href="https://www.federalreserve.gov/data.htm">Federal Reserve</a></li>
<li><a href="https://data.europa.eu/euodp/en/data/">European Union</a></li>
<li><a href="https://www.ecb.europa.eu/stats/html/index.en.html">European Central Bank</a></li>
<li>statistical office of your own country, e.g. <a href="https://opendata.cbs.nl/statline/#/CBS/en/">Statistics Netherlands</a></li>
<li>if you want to use another economic data source, ask us first</li>
</ul></li>
<li>Data handling:    
<ul class="org-ul">
<li>download the data to your repos. (in a separate folder &ldquo;data&rdquo;) and</li>
<li>in your notebook create a link to the website of the data source</li>
<li>give the code how you merged separate datasets into one big dataset that you use</li>
<li>explain what you did (including the code) and why you did the data cleaning steps to get the data from the downloads to the data that you use in the analysis</li>
</ul></li>
<li>Start your analysis with a clear and transparent <b>question</b>.</li>
<li>Briefly <b>motivate</b> why this question is interesting.</li>
<li>Explain the <b>methods</b> that you use to answer the question.
<ul class="org-ul">
<li>are your methods based on correlations (only)?</li>
<li>do they allow you to make claims about causality?</li>
</ul></li>
<li>Give the <b>answer</b> that you find (as a preview).</li>
<li>Mention the main <b>assumptions</b> that you need to get this answer.</li>
<li>Use graphs to introduce your data</li>
<li>If you use equations, use latex to make them easy to read.</li>
<li>Explain your code, the reader &#x2013;think of your fellow students&#x2013; must be able to easily follow what you are doing.</li>
<li>How well does your model <b>fit</b> the data?
<ul class="org-ul">
<li>what methods do you use to evaluate this?</li>
</ul></li>
<li>Present a clear conclusion/answer to your question.</li>
<li>Include some <b>discussion</b> of what you find and elements on which you need additional information.</li>
</ul>

<p>
Three remarks:
</p>
<ul class="org-ul">
<li>you can copy code from the web; but
<ul class="org-ul">
<li>make sure that you explain the code that you use so that another student of the course understands it and can use it;</li>
<li>give the reference of the code that you copy;</li>
</ul></li>
<li>use <b>common sense</b>: it is not always necessary to have a full blown economic model, but we do expect you to think!
<ul class="org-ul">
<li>in the past we had students looking at the effect of age on income in sports; &ldquo;theory&rdquo; suggests that this relation is hump-shaped: 5 year olds and 80 year olds tend not to earn a lot of money as elite athletes; the students presented a scatter plot with a clear hump-shape; then they wrote &ldquo;now we do a linear regression&rdquo;.</li>
<li>for each step that you program, ask yourself why this step makes sense and then explain this in your notebook.</li>
</ul></li>
<li>show us what you have learned during this course; hence use a <b>number</b> of topics we discussed in your final assignment, for example:
<ul class="org-ul">
<li>simulate data to verify the estimation techniques that you use</li>
<li>download your data in the notebook using a python API</li>
<li>use pandas to merge different datasets, clean your data, create new variables</li>
<li>explain clearly what the causal relations are in your analysis</li>
<li>use methods like: ridge and lasso regressions, neural network, Bayesian analysis
<ul class="org-ul">
<li>explain why you use these methods to answer your research question (what are pros and cons of the methods)</li>
<li>explain the choices that you make within a method (think of the number of layers and epochs in a neural network)</li>
<li>use more than one method and compare the results:
<ul class="org-ul">
<li>discuss what is different and why</li>
</ul></li>
</ul></li>
<li>simply downloading an existing dataset and estimating a neural network on this will not be enough to get a passing grade</li>
</ul></li>
</ul>
</div>
</div>
