index.html
<div id="outline-container-orga287d34" class="outline-3">
<h3 id="orga287d34"><span class="section-number-3">4.2.</span> resit of final assignment</h3>
<div class="outline-text-3" id="text-4-2">
<p>
The resit of the final assignment needs to be a new project compared to the one you handed in before. The easiest way to achieve this is to choose a new research question and a new data set. You can use the same data if you make sure that research question and analysis are sufficiently different from before.
</p>

<p>
Simply adjusting your first submission based on our feedback will be not be enough. 
</p>

<p>
Apart from this, follow the procedure above on how to submit the assignment and fill in the google form.
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Jan Boone</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
